of60/tutorials/rheoHeatFoam/buoyantCavity/Newtonian/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(top|down)"
    {
        type            zeroGradient;     
    }
    
    left
    {
        type           fixedValue;
        value          uniform  0.5;
    }
    
    right
    {
        type           fixedValue;
        value          uniform  -0.5;
    }
    
    frontAndBack
    {
        type     empty;
    }
     
}

// ************************************************************************* //
